bog_app/app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    @creatures = Creature.all

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["description", "test"], ["created_at", "2016-08-14 01:24:32.600631"], ["updated_at", "2016-08-14 01:24:32.600631"]]
---
  def create
    creature = Creature.new(creature_params)
    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 9]]
---
  def show
    @creature = Creature.find_by_id(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @creature = Creature.find_by_id(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "name" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["name", "YodaMAN"], ["updated_at", "2016-08-14 03:03:43.349256"], ["id", 1]]
---
  def update
    creature = Creature.find_by_id(params[:id])
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 1]]
---
  def destroy
    creature = Creature.find_by_id(params[:id])
    creature.destroy