bog_app/bog_app/app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    @creatures=Creature.all

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1111"], ["description", "1"], ["created_at", "2016-08-14 21:36:12.316999"], ["updated_at", "2016-08-14 21:36:12.316999"]]
---
  def create
    creature = Creature.new(creature_params)
    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @creature = Creature.find_by_id(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 7]]
---
  def edit
    @creature = Creature.find_by_id(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Moisture farming is a tough racket111"], ["updated_at", "2016-08-14 22:20:10.322900"], ["id", 7]]
---
  def update
    creature = Creature.find_by_id(params[:id])
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 7]]
---
  def destroy
    creature = Creature.find_by_id(params[:id])
    creature.destroy